from pprint import pprint

from app.kafi_narrators import extract_narrators
from app.models import Chapter, Language, PartType, Translation, Verse


def assert_text_narrators(text, narrators):
    v = Verse()
    v.text = [text]
    actual = extract_narrators(v)
    print('####################### EXPECTED')
    pprint(narrators)
    print('####################### ACTUAL')
    pprint(actual)
    assert actual == narrators

def test_1_1_1_1():
    assert_text_narrators(
        'أخْبَرَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنِي عِدَّةٌ مِنْ أَصْحَابِنَا مِنْهُمْ مُحَمَّدُ بْنُ يَحْيَى الْعَطَّارُ عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ الْحَسَنِ بْنِ مَحْبُوبٍ عَنِ الْعَلَاءِ بْنِ رَزِينٍ عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ لَمَّا خَلَقَ اللَّهُ الْعَقْلَ اسْتَنْطَقَهُ ثُمَّ قَالَ لَهُ أَقْبِلْ فَأَقْبَلَ ثُمَّ قَالَ لَهُ أَدْبِرْ فَأَدْبَرَ ثُمَّ قَالَ وَ عِزَّتِي وَ جَلَالِي مَا خَلَقْتُ خَلْقاً هُوَ أَحَبُّ إِلَيَّ مِنْكَ وَ لَا أَكْمَلْتُكَ إِلَّا فِيمَنْ أُحِبُّ أَمَا إِنِّي إِيَّاكَ آمُرُ وَ إِيَّاكَ أَنْهَى وَ إِيَّاكَ أُعَاقِبُ وَ إِيَّاكَ أُثِيبُ .',
        [
            'أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ يَعْقُوبَ',
            'عِدَّةٌ مِنْ أَصْحَابِنَا',
            'مُحَمَّدُ بْنُ يَحْيَى الْعَطَّارُ',
            'أَحْمَدَ بْنِ مُحَمَّدٍ',
            'الْحَسَنِ بْنِ مَحْبُوبٍ',
            'الْعَلَاءِ بْنِ رَزِينٍ',
            'مُحَمَّدِ بْنِ مُسْلِمٍ',
            'أَبِي جَعْفَرٍ ( عليه السلام )'
        ]
    )

def test_1_1_1_10():
    assert_text_narrators(
        'مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدٍ عَنِ ابْنِ مَحْبُوبٍ عَنْ عَبْدِ اللَّهِ بْنِ سِنَانٍ قَالَ ذَكَرْتُ لِأَبِي عَبْدِ اللَّهِ ( عليه السلام ) رَجُلًا مُبْتَلًى بِالْوُضُوءِ وَ الصَّلَاةِ وَ قُلْتُ هُوَ رَجُلٌ عَاقِلٌ فَقَالَ أَبُو عَبْدِ اللَّهِ وَ أَيُّ عَقْلٍ لَهُ وَ هُوَ يُطِيعُ الشَّيْطَانَ فَقُلْتُ لَهُ وَ كَيْفَ يُطِيعُ الشَّيْطَانَ فَقَالَ سَلْهُ هَذَا الَّذِي يَأْتِيهِ مِنْ أَيِّ شَيْ\u200fءٍ هُوَ فَإِنَّهُ يَقُولُ لَكَ مِنْ عَمَلِ الشَّيْطَانِ .',
        [
            'مُحَمَّدُ بْنُ يَحْيَى',
            'أَحْمَدَ بْنِ مُحَمَّدٍ',
            'ابْنِ مَحْبُوبٍ',
            'عَبْدِ اللَّهِ بْنِ سِنَانٍ'
        ]
    )

def test_1_2_3_1():
    assert_text_narrators(
        'عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى جَمِيعاً عَنِ ابْنِ مَحْبُوبٍ عَنْ أَبِي أُسَامَةَ عَنْ هِشَامِ بْنِ سَالِمٍ عَنْ أَبِي حَمْزَةَ عَنْ أَبِي إِسْحَاقَ السَّبِيعِيِّ عَمَّنْ حَدَّثَهُ مِمَّنْ يُوثَقُ بِهِ قَالَ سَمِعْتُ أَمِيرَ الْمُؤْمِنِينَ ( عليه السلام ) يَقُولُ إِنَّ النَّاسَ آلُوا بَعْدَ رَسُولِ اللَّهِ ( صلى الله عليه وآله ) إِلَى ثَلَاثَةٍ آلُوا إِلَى عَالِمٍ عَلَى هُدًى مِنَ اللَّهِ قَدْ أَغْنَاهُ اللَّهُ بِمَا عَلِمَ عَنْ عِلْمِ غَيْرِهِ وَ جَاهِلٍ مُدَّعٍ لِلْعِلْمِ لَا عِلْمَ لَهُ مُعْجَبٍ بِمَا عِنْدَهُ قَدْ فَتَنَتْهُ الدُّنْيَا وَ فَتَنَ غَيْرَهُ وَ مُتَعَلِّمٍ مِنْ عَالِمٍ عَلَى سَبِيلِ هُدًى مِنَ اللَّهِ وَ نَجَاةٍ ثُمَّ هَلَكَ مَنِ ادَّعَى وَ خَابَ مَنِ افْتَرَى .',
        [
            'عَلِيُّ بْنُ مُحَمَّدٍ',
            'سَهْلِ بْنِ زِيَادٍ',
            'مُحَمَّدُ بْنُ يَحْيَى',
            'أَحْمَدَ بْنِ مُحَمَّدِ بْنِ عِيسَى',
            'ابْنِ مَحْبُوبٍ',
            'أَبِي أُسَامَةَ',
            'هِشَامِ بْنِ سَالِمٍ',
            'أَبِي حَمْزَةَ',
            'أَبِي إِسْحَاقَ السَّبِيعِيِّ',
            'حَدَّثَهُ',
            'يُوثَقُ بِهِ'
        ]
    )

def test_1_2_1_9():
    assert_text_narrators(
        'عَلِيُّ بْنُ مُحَمَّدٍ عَنْ سَهْلِ بْنِ زِيَادٍ عَنْ مُحَمَّدِ بْنِ عِيسَى عَمَّنْ رَوَاهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) قَالَ قَالَ لَهُ رَجُلٌ جُعِلْتُ فِدَاكَ رَجُلٌ عَرَفَ هَذَا الْأَمْرَ لَزِمَ بَيْتَهُ وَ لَمْ يَتَعَرَّفْ إِلَى أَحَدٍ مِنْ إِخْوَانِهِ قَالَ فَقَالَ كَيْفَ يَتَفَقَّهُ هَذَا فِي دِينِهِ ',
        [
            "عَلِيُّ بْنُ مُحَمَّدٍ",
            "سَهْلِ بْنِ زِيَادٍ",
            "مُحَمَّدِ بْنِ عِيسَى عَمَّنْ رَوَاهُ",
            "أَبِي عَبْدِ اللَّهِ ( عليه السلام )"
        ]
    )

def test_1_3_1_1():
    assert_text_narrators(
        'أَخْبَرَنَا أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ يَعْقُوبَ قَالَ حَدَّثَنِي عَلِيُّ بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ عَنْ أَبِيهِ عَنِ الْحَسَنِ بْنِ إِبْرَاهِيمَ عَنْ يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَلِيِّ بْنِ مَنْصُورٍ قَالَ قَالَ لِي هِشَامُ بْنُ الْحَكَمِ كَانَ بِمِصْرَ زِنْدِيقٌ تَبْلُغُهُ عَنْ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) أَشْيَاءُ فَخَرَجَ إِلَى الْمَدِينَةِ لِيُنَاظِرَهُ فَلَمْ يُصَادِفْهُ بِهَا وَ قِيلَ لَهُ إِنَّهُ خَارِجٌ بِمَكَّةَ فَخَرَجَ إِلَى مَكَّةَ وَ نَحْنُ مَعَ أَبِي عَبْدِ اللَّهِ فَصَادَفَنَا وَ نَحْنُ مَعَ أَبِي عَبْدِ اللَّهِ ( عليه السلام ) فِي الطَّوَافِ وَ كَانَ اسْمُهُ عَبْدَ الْمَلِكِ وَ كُنْيَتُهُ أَبُو عَبْدِ اللَّهِ',
        [
            'أَبُو جَعْفَرٍ مُحَمَّدُ بْنُ يَعْقُوبَ',
            'عَلِيُّ بْنُ إِبْرَاهِيمَ بْنِ هَاشِمٍ',
            'أَبِيهِ',
            'الْحَسَنِ بْنِ إِبْرَاهِيمَ',
            'يُونُسَ بْنِ عَبْدِ الرَّحْمَنِ',
            'عَلِيِّ بْنِ مَنْصُورٍ'
        ]
    )

def test_8_1_13_1():
    assert_text_narrators(
        '14475-\xa0 أَبُو عَلِيٍّ الْأَشْعَرِيُّ عَنْ مُحَمَّدِ بْنِ سَالِمٍ وَ عَلِيُّ بْنُ إِبْرَاهِيمَ عَنْ أَبِيهِ جَمِيعاً عَنْ أَحْمَدَ بْنِ النَّضْرِ وَ مُحَمَّدُ بْنُ يَحْيَى عَنْ مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ عَنِ الْحُسَيْنِ بْنِ أَبِي قَتَادَةَ جَمِيعاً عَنْ عَمْرِو بْنِ شِمْرٍ عَنْ جَابِرٍ عَنْ أَبِي جَعْفَرٍ ( عليه السلام ) قَالَ خَرَجَ رَسُولُ اللَّهِ ( صلى الله عليه وآله ) لِعَرْضِ الْخَيْلِ فَمَرَّ بِقَبْرِ أَبِي أُحَيْحَةَ فَقَالَ أَبُو بَكْرٍ لَعَنَ اللَّهُ صَاحِبَ هَذَا الْقَبْرِ فَوَ اللَّهِ إِنْ كَانَ لَيَصُدُّ عَنْ سَبِيلِ اللَّهِ وَ يُكَذِّبُ رَسُولَ اللَّهِ ( صلى الله عليه وآله ) فَقَالَ خَالِدٌ ابْنُهُ بَلْ لَعَنَ اللَّهُ أَبَا قُحَافَةَ فَوَ اللَّهِ مَا كَانَ يُقْرِي الضَّيْفَ وَ لَا يُقَاتِلُ الْعَدُوَّ فَلَعَنَ اللَّهُ أَهْوَنَهُمَا عَلَى الْعَشِيرَةِ فَقْداً فَأَلْقَى رَسُولُ اللَّهِ ( صلى الله عليه وآله ) خِطَامَ رَاحِلَتِهِ عَلَى غَارِبِهَا ثُمَّ قَالَ إِذَا أَنْتُمْ تَنَاوَلْتُمُ الْمُشْرِكِينَ فَعُمُّوا وَ لَا تَخُصُّوا فَيَغْضَبَ وُلْدُهُ',
        [
            'أَبُو عَلِيٍّ الْأَشْعَرِيُّ',
            'مُحَمَّدِ بْنِ سَالِمٍ',
            'عَلِيُّ بْنُ إِبْرَاهِيمَ',
            'أَبِيهِ',
            'أَحْمَدَ بْنِ النَّضْرِ',
            'مُحَمَّدُ بْنُ يَحْيَى',
            'مُحَمَّدِ بْنِ أَبِي الْقَاسِمِ',
            'الْحُسَيْنِ بْنِ أَبِي قَتَادَةَ',
            'عَمْرِو بْنِ شِمْرٍ',
            'جَابِرٍ',
            'أَبِي جَعْفَرٍ ( عليه السلام )'
        ]
    )
